cmsis-svd/cmsis-svd/data/Fujitsu/MB9BF31xN.svd
        <!-- REGISTER "PDIR3" -->
        <register derivedFrom="DDR3">
          <name>PDIR3</name>
          <description>Port input data register 3</description>
          <addressOffset>0x30C</addressOffset>
        </register>
        <!-- REGISTER "PDIR4" -->
        <register derivedFrom="DDR4">
          <name>PDIR4</name>
          <description>Port input data register 4</description>
          <addressOffset>0x310</addressOffset>
        </register>
        <!-- REGISTER "PDIR5" -->
        <register derivedFrom="DDR5">
          <name>PDIR5</name>
          <description>Port input data register 5</description>
          <addressOffset>0x314</addressOffset>
        </register>
        <!-- REGISTER "PDIR6" -->
        <register derivedFrom="DDR6">
          <name>PDIR6</name>
          <description>Port input data register 6</description>
          <addressOffset>0x318</addressOffset>
        </register>
        <!-- REGISTER "PDIR8" -->
        <register derivedFrom="DDR8">
          <name>PDIR8</name>
          <description>Port input data register 8</description>
          <addressOffset>0x320</addressOffset>
        </register>
        <!-- REGISTER "PDIRE" -->
        <register derivedFrom="DDRE">
          <name>PDIRE</name>
          <description>Port input data register E</description>
          <addressOffset>0x338</addressOffset>
        </register>
        <!-- REGISTER "PDOR0" -->
        <register derivedFrom="DDR0">
          <name>PDOR0</name>
          <description>Port output data register 0</description>
          <addressOffset>0x400</addressOffset>
        </register>
        <!-- REGISTER "PDOR1" -->
        <register derivedFrom="DDR1">
          <name>PDOR1</name>
          <description>Port output data register 1</description>
          <addressOffset>0x404</addressOffset>
        </register>
        <!-- REGISTER "PDOR2" -->
        <register derivedFrom="DDR2">
          <name>PDOR2</name>
          <description>Port output data register 2</description>
          <addressOffset>0x408</addressOffset>
        </register>
        <!-- REGISTER "PDOR3" -->
        <register derivedFrom="DDR3">
          <name>PDOR3</name>
          <description>Port output data register 3</description>
          <addressOffset>0x40C</addressOffset>
        </register>
        <!-- REGISTER "PDOR4" -->
        <register derivedFrom="DDR4">
          <name>PDOR4</name>
          <description>Port output data register 4</description>
          <addressOffset>0x410</addressOffset>
        </register>
        <!-- REGISTER "PDOR5" -->
        <register derivedFrom="DDR5">
          <name>PDOR5</name>
          <description>Port output data register 5</description>
          <addressOffset>0x414</addressOffset>
        </register>
        <!-- REGISTER "PDOR6" -->
        <register derivedFrom="DDR6">
          <name>PDOR6</name>
          <description>Port output data register 6</description>
          <addressOffset>0x418</addressOffset>
        </register>
        <!-- REGISTER "PDOR8" -->
        <register derivedFrom="DDR8">
          <name>PDOR8</name>
          <description>Port output data register 8</description>
          <addressOffset>0x420</addressOffset>
        </register>
        <!-- REGISTER "PDORE" -->
        <register derivedFrom="DDRE">
          <name>PDORE</name>
          <description>Port output data register E</description>
          <addressOffset>0x438</addressOffset>
        </register>
        <!-- REGISTER "ADE" -->
        <register>
          <name>ADE</name>
          <description>Analog input setting register</description>
          <addressOffset>0x500</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000FFFF</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "AN15" -->
            <field>
              <name>AN15</name>
              <description>Bit15 of ADE</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN14" -->
            <field>
              <name>AN14</name>
              <description>Bit14 of ADE</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN13" -->
            <field>
              <name>AN13</name>
              <description>Bit13 of ADE</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN12" -->
            <field>
              <name>AN12</name>
              <description>Bit12 of ADE</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN11" -->
            <field>
              <name>AN11</name>
              <description>Bit11 of ADE</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN10" -->
            <field>
              <name>AN10</name>
              <description>Bit10 of ADE</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN9" -->
            <field>
              <name>AN9</name>
              <description>Bit9 of ADE</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN8" -->
            <field>
              <name>AN8</name>
              <description>Bit8 of ADE</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN7" -->
            <field>
              <name>AN7</name>
              <description>Bit7 of ADE</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN6" -->
            <field>
              <name>AN6</name>
              <description>Bit6 of ADE</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN5" -->
            <field>
              <name>AN5</name>
              <description>Bit5 of ADE</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN4" -->
            <field>
              <name>AN4</name>
              <description>Bit4 of ADE</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN3" -->
            <field>
              <name>AN3</name>
              <description>Bit3 of ADE</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN2" -->
            <field>
              <name>AN2</name>
              <description>Bit2 of ADE</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN1" -->
            <field>
              <name>AN1</name>
              <description>Bit1 of ADE</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN0" -->
            <field>
              <name>AN0</name>
              <description>Bit0 of ADE</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
